app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
---
  def create
      @user = User.find_by(email: session_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]
---
  def is_logged_in?
      if logged_in? && session[:user_id]
        render json: {
          logged_in: true,
          user: User.find(session[:user_id])