app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test2.com"], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:email])

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "helloworld@test.com"], ["LIMIT", 1]]
UPDATE "users" SET "weight" = $1, "height" = $2 WHERE "users"."id" = $3  [["weight", 150.0], ["height", 150.0], ["id", 98]]
---
  def update
    @user = User.where(email: params[:user][:email]).take

    if @user.update(user_params)

INSERT INTO "users" ("email", "password", "first_name", "last_name", "weight", "height", "age", "gender", "goal_id", "activity_level_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "goals".* FROM "goals" WHERE "goals"."description" = $1 LIMIT $2  [["description", "Gain 1 lb per week"], ["LIMIT", 1]]
SELECT "activity_levels".* FROM "activity_levels" WHERE "activity_levels"."description" = $1 LIMIT $2  [["description", "Heavy exercise"], ["LIMIT", 1]]
---
  def user_params
    h = params.require(:user).permit(:email, :password,
                                     :first_name, :last_name, :age, :weight,
                                     :height, :gender, :activity_level, :fitness_goal)
    g = Goal.find_by(description: h[:fitness_goal])
    a = ActivityLevel.find_by(description: h[:activity_level])